<a href="https://colab.research.google.com/github/dubeyshubham786/Python_libraries/blob/main/Pandas_4.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Filtering - Using Conditionals to Filter Rows and Columns

In [ ]:
import pandas as pd

In [ ]:
people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [ ]:
df = pd.DataFrame(people)

In [ ]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [ ]:
filt = df['last'] == 'Doe'

In [ ]:
df[filt]

  first last              email
1  Jane  Doe  JaneDoe@email.com
2  John  Doe  JohnDoe@email.com

In [ ]:
df.loc[filt]

  first last              email
1  Jane  Doe  JaneDoe@email.com
2  John  Doe  JohnDoe@email.com

In [ ]:
df.loc[filt, 'email']

1    JaneDoe@email.com
2    JohnDoe@email.com
Name: email, dtype: object

In [ ]:
#  We can also use AND OR operator by the symbol & |
# Let's say we want last name as Doe and first name as John

filt = (df['last'] == 'Doe') & (df['first'] == 'John')

In [ ]:
df.loc[filt, 'email']

2    JohnDoe@email.com
Name: email, dtype: object

In [ ]:
# If we want last name as Schafer and first name as John

filt = (df['last'] == 'Schafer') | (df['first'] == 'John')

In [ ]:
df.loc[filt, 'email']

0    CoreyMSchafer@gmail.com
2          JohnDoe@email.com
Name: email, dtype: object

## Now with the imdb dataset

In [ ]:
from google.colab import drive
drive.mount('/content/gdrive/')

Mounted at /content/gdrive/

In [ ]:
df = pd.read_csv('/content/gdrive/MyDrive/Colab Notebooks/Github/Pandas/imdb_data.csv', index_col='id')

In [ ]:
df.head()

                                belongs_to_collection  ...   revenue
id                                                     ...
1   [{'id': 313576, 'name': 'Hot Tub Time Machine ...  ...  12314651
2   [{'id': 107674, 'name': 'The Princess Diaries ...  ...  95149435
3                                                 NaN  ...  13092000
4                                                 NaN  ...  16000000
5                                                 NaN  ...   3923970

[5 rows x 22 columns]

In [ ]:
# If we want movies which are greater than 200 minutes

long_movies = (df['runtime'] > 200)

In [ ]:
df.loc[long_movies]

# All the movies below is more than 200 minutes long

     belongs_to_collection  ...    revenue
id                          ...
524                    NaN  ...  122700000
626                    NaN  ...  146900000
1212                   NaN  ...     871279
1303                   NaN  ...    3484331
1915                   NaN  ...   12923936
1923                   NaN  ...   71000000
1976                   NaN  ...     393816
2354                   NaN  ...   13000000

[8 rows x 22 columns]

In [ ]:
# Let's say from this dataframe we want column like release_date, title and budget

df.loc[long_movies, ['title', 'release_date', 'budget']]

                     title release_date    budget
id
524   The Ten Commandments      10/5/56  13000000
626                Ben-Hur     12/26/59  15000000
1212                Carlos      5/19/10  18000000
1303         Heaven's Gate     11/19/80  44000000
1915     Gods and Generals      2/21/03  56000000
1923             Cleopatra      6/12/63  31115000
1976        Chapiteau-Show     12/12/11   2000000
2354          Jodhaa Akbar      2/15/08   8376800

In [ ]:
df.head()

                                belongs_to_collection  ...   revenue
id                                                     ...
1   [{'id': 313576, 'name': 'Hot Tub Time Machine ...  ...  12314651
2   [{'id': 107674, 'name': 'The Princess Diaries ...  ...  95149435
3                                                 NaN  ...  13092000
4                                                 NaN  ...  16000000
5                                                 NaN  ...   3923970

[5 rows x 22 columns]

In [ ]:
# Let's say now we want our production country to be India, Korea and United States

countries = ['India', 'United States', 'korea']
filt = df['production_countries'].isin(countries)

In [ ]:
df.loc[filt, 'production_countries']

Series([], Name: production_countries, dtype: object)

# Pandas series documentation click [here](https://pandas.pydata.org/docs/reference/api/pandas.Series.html).